# ДАННЫЙ ФАЙЛ ПАРСИЛ ДАННЫЕ С ИЗВЕСТНОГО КАЗАХСКО-РУССКОГО СЛОВОРЯ SOZDIK.KZ
# ВСЕ ДАННЫЕ ВЫВОДЯТЬСЯ В ТЕРМИНАЛ
import requests
from bs4 import BeautifulSoup


phrases = {'әбілхаят суы': 'живая вода',
           'абырой болғанда': 'к счастью', 'абыройы айрандай төгілу': 'опозориться',
           'ағама жеңгем сай': 'друг-друга стоят', 'ағаш атқа мінгізу': 'распускать плохие слухи',
           'ағаштан түйін түю': 'мастер на все руки', 'ағы ақ қызылы қызыл болу': 'имеет цветущий вид',
           'ағыл-тегіл жылау': 'горько плакать', 'Aғынан жарылу': 'раскрыть душу',
           'Aғып тұр (тұрған)': 'владеть словом, оратор', 'Aдам айтқысыз': 'невообразимый',
           'адам санатына қосу': 'добиться всеобщего признания',
           'адасқан қаздай қаңқылдау': 'состояние, беспокойства', 'адыра қалу': 'исчезнуть навсегда',
           'Aжал айдау': 'идти насмерть', 'Aжал аузы': 'перед смертью',
           'айна қатесіз': 'сильно похож', 'айрандай аптап күбідей күптеп': 'подчинить себе',
           'айтқанына көндіріп ұстау': 'заставлять слушаться ', 'Айылын жимау': 'не бояться  ',
           'Aқ жүрек': 'прямодушный', 'Aқ көңіл': 'простодушный', 'Aқша табу': 'зарабатывать',
           'Aқылға сыймау': 'уму непостижимо ', 'ала қаптың аузын ашу': 'ничего не жалеть ',
           'арасынан қыл өтпеу': 'неразлучны', 'арқа сүйеу': 'стоять за спиной',
           'Асығы алшысынан түсу ': 'крупно повезло', 'Асығы түгел': 'быть в благополучии', 'Aт көпір': 'очень много',
           'ат құлағында ойнау': 'лихо скакать на коне', 'Aт салысу': 'принимать участие',
           'Aталы сөз': 'слово назидание', 'Aузы берік': ' не болтливый', 'Aуыз тию': 'отведать пищу',
           'аяқтыға жол ауыздыға сөз бермейтін': 'ни в чём не уступать', 'Aшуға булығу': 'сдерживать гнев',
           'Aяқ астынан': 'внезапно', 'бас аяғы жоқ': 'без веских причин', 'Бас ию': 'Кланяться, Преклоняться',
           'Бас қосу': 'Совместно обсуждать, Пожениться', 'Бас тарту': 'наотрез отказаться',
           'Басынан сөз асырмау': 'дать ответ на любое замечание', 'Бауы берік болсын': 'пусть младенец будет крепок',
           'Бел буу': 'решиться', 'Бетке шіркеу болу': 'быть позорным пятном',
           'Бүйректен сирақ шығару': 'искажать суть',
           'дайын асқа ие болу': 'достаться без труда', 'Дес бергенде': 'к счастью', 'Дес бермеу': 'не уступать',
           'Дес беру': 'уступать', 'дес тию': 'получить власть', 'Душар болу': 'попасть  в беду',
           'Дүние есігін ашу': 'родиться', 'Дүние салу': 'умереть', 'Дүниеге келу': 'рождаться',
           'Дінi қатты ': 'бездушный', 'дымы құру': 'изнемогать', 'Дірдек қағу': 'дрожать от холода',
           'Ебін табу': 'найти выход', 'Егіз қозыдай': 'похожи на друг друга', 'Екі дүниеде': 'вечно',
           'Екі қолға бір күрек': 'любая работа', 'екі шоқып бір қарау': 'быть осторожным',
           'ел аузына іліну': 'стать известным', 'Елден ала бөтен': 'выделяться среди людей',
           'мұрнынан құрты түсу': 'быть в богатстве', 'Есін жию': 'прийти в себя', 'Жалаң аяқ': 'босиком',
           'жан ашыр': 'сочувствовать', 'Жаны сірі ': 'живучий человек', 'Жеме-жемге келгенде': 'в решающий момент',
           'Жерге қарату': 'заставлять стыдиться', 'Жоққа жүйрік жетпейді': 'чего нет того нет',
           'Жоқтың қасы': 'ничтожно мало', 'жол болсын': 'счастливого пути!', 'Жол түсу': 'проложить путь',
           'жұлдыздай ағып өту': 'промчаться', 'Жұлдызы оңынан туды': 'выпало счастье',
           'Жұлдызы ыстық': 'везет в любви', 'Жүрек айну ': 'испытывать тошноту', 'Жүрек жалғау': 'перекусить',
           'Жіпсіз байлану': 'быть обездействованным', 'Ит өлген жер': 'очень далеко',
           'Көз айырмау': 'пристально смотреть', 'Көз ашпау': 'непрестанно предаваться действию',
           'Көз жету': 'убедиться', 'Көз көрген': 'лично знавший',
           'Көз қырын салу': ' Наблюдать за кем-то. Уделять внимание', 'Көз тұну': 'глаза разбегаются',
           'көз ілмеу': 'не засыпать', 'Көзайым болу': 'радоваться встрече',
           'Көзге күйік болу': 'раздражать присутствием', 'көзді ашып-жұмғанша': 'моментально',
           'Көзіне шөп салу': 'вредить изподтишка, изменять', 'көзіңді ашып қарау': 'посмотреть как следует',
           'Көңіл айту': 'выражать соболезнование', 'Көңіл бөлу': 'уделять внимание', 'Көңіл қалу': 'разочароваться',
           'Көре алмау ': 'завидовать', 'Көрсе қызар': 'завистник', 'Қам жеу': 'беспокоиться',
           'Қапы қалу': 'упустить что-либо, не заметив', 'Қапысы жоқ': 'безупречный', 'Қапысын табу': 'поймать момент',
           'Қарны ашты': 'проголодаться', 'Қозы көш жер ': 'небольшое расстояние',
           'Қол қою': 'ставить подпись, признавать, браться за работу', 'Қол қусыру': 'ничего не делать',
           'Қол тимеу': 'некогда', 'Қол ұшын беру': 'помогать кому либо', 'Қолдан келу': 'мочь, уметь',
           'қоясын ашу': 'разоблачать', 'Құдай білсін': 'неизвестно',
           'құдай төбеңнен ұрғыр': 'пусть бог тебя накажет', 'Құйып қойғандай': 'как раз',
           'Құлағым сізде': 'я вас слушаю', 'Құлағына алтын сырға ': 'иметь ввиду',
           'Құлақ аспау': 'не обращать внимания', 'Құлақ асу': 'быть внимательным',
           'Құлақ етін жеу': 'надоедать разговорами', 'құлақ тігу': 'прислушиваться',
           'Құрақ ұшу': 'стараться угодить кому-либо', 'Қытығына тию': 'задеть за живое',
           'маңдайға жазылған': 'так суждено', 'Мойнына алу': 'признать вину',
           'Мұрнымды кесіп берейін': 'готов поспорить', 'ойда жоқ жерден': 'нежданно, негаданно',
           'Оң қарау': 'относиться благосклонно', 'өкпесі қара қазандай болу': 'сильно обижаться',
           'Өтірікке сүттей ұю': 'считать правдой вымысел', 'сары бел':'возвышенность', 'сазайын тартқызу': 'наказать',
           'сегіз қырлы бір сырлы': 'многосторонне талантлив', 'Суық тию': 'простудиться',
           'Сүттей ұю': 'в полном согласии', 'Сыр беру': 'показывать свою слабость',
           'Сыртынан күлу': 'смеяться за спиной', 'табанды жалтырату': 'быстро убегать',
           'Тас жүрек': 'бесчувственный', 'Таяқ жеу': 'быть побитым', 'Таяқ тастам жер': 'близко, рядом',
           'Төбеге ұрғандай болу': 'быть ошеломленным', 'Түбіне жету ': 'лишить сил',
           'Тіл үйіру ': 'очень вкусно', 'Тірі аруақ': 'кожа да кости', 'Тіс жармау': 'не говорить ни слова',
           'Тіс қаққан': 'опытный', 'Ұлардай шулау ': 'зашуметь', 'Үрерге иті жоқ': 'ни кола ни двора',
           'Үріп ауызға салғандай': 'симпатичный,  милый', 'үш қайнаса сорпасы қосылмайды': 'соверщенно разные',
           'Шаш ал десе бас алу': 'терять чувство меры', 'ши борбай': 'очень худой', 'Шикі өкпе': 'юнец, малыш',
           'Шөп басын сындырмау ': 'ничего не делать', 'шынашағына татымайды': 'не стоит и мизинца',
           'Шыр бітпеу': 'жить в бедности', 'ізін суытпау': 'по горячим следам', 'іш тарту': 'проявлять теплые чувства',
           'іші пысу': 'скучать', 'ішіне шынашақ айналмайды': 'очень жадный'}

kazakhs = []
for kz, ru in phrases.items():
    kazakhs.append(kz)




headers = {'accept': '*/*',
'user-agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/76.0.3809.132 Safari/537.36'}

def parss_lxml(word, headers):
    session = requests.Session()
    base_url = 'https://sozdik.kz/ru/dictionary/translate/kk/ru/{}/'.format(word)
    request = session.get(base_url, headers=headers)
    if request.status_code == 200:
        soup = BeautifulSoup(request.content, 'lxml')
        word = soup.find('p', attrs={"id": "dictionary_translate_article_translation"}).text
        sinonyms = soup.find('span', attrs={"id": "dictionary_translate_article_synonyms"}).text
        return print(word + "\n" + sinonyms + "\n----------------------------------------------------------")

    else:
        print("ERROR")


for soz in kazakhs:
    soz = soz.lower().strip()
    print(soz)
    parss_lxml(soz, headers)



